import './App.css';

function App() {
  return (
    <div className="App">
      hello
    </div>
  );
}

export default App;

// https://pokeapi.co/
// головна сторінка : сторінка на  якій зображені всі покемони з назвами та фото, по 20 на сторінці + пагінація
// при кліку на покемона відобразити сторінку конкретного покемона
// Сторінка покемона - відобразити  інформацію про покемона: abilities,stats,type, фото, та  forms(!!!)
// Форми покемона повинні бути кнопкою, при кліку на яку, відбувається перехід на сторінку  з обраною формою та основними характеристиками форми

// В проєкті реалізувати пошук конкретного покемона за назвою,
// пошук покемонів по типу,
// пошук по ability